---
title: FamilyUtils
classe: Autodesk.Revit.DB.FamilyUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FamilyUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void ConvertFamilyToFaceHostBased(Document, ElementId)` | `FamilyUtils.ConvertFamilyToFaceHostBased(document, familyId)` | Void |
| `Boolean FamilyCanConvertToFaceHostBased(Document, ElementId)` | `FamilyUtils.FamilyCanConvertToFaceHostBased(document, familyId)` | Boolean |
| `ICollection<ElementId> GetProfileSymbols(Document, ProfileFamilyUsage, Boolean)` | `FamilyUtils.GetProfileSymbols(document, profileFamilyUsage, oneCurveLoopOnly)` | ICollection<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```